spec/vcr/payment_sessions/success_without_channel.yml

---
http_interactions:
- request:
    method: post
    uri: https://checkout-test.adyen.com/v71/sessions
    body:
      encoding: UTF-8
      string: '{"metadata":{"spree_payment_method_id":1,"spree_order_id":"R651007997"},"amount":{"value":11000,"currency":"USD"},"returnUrl":"http://www.example.com/adyen/payment_sessions/redirect","reference":"R651007997_1_1","countryCode":"US","lineItems":[{"amountExcludingTax":1000,"amountIncludingTax":1000,"description":"Product
        14375","id":1,"sku":"SKU-1","quantity":1}],"merchantAccount":"SpreeCommerceECOM","merchantOrderReference":"R651007997","expiresAt":"2025-08-12T23:00:00Z","shopperName":{"firstName":"John","lastName":"Doe"},"shopperEmail":null,"shopperReference":"guest_R651007997","recurringProcessingModel":"UnscheduledCardOnFile","shopperInteraction":"Ecommerce","storePaymentMethodMode":"enabled"}'
    headers:
      Content-Type:
      - application/json
      User-Agent:
      - adyen-ruby-api-library/10.3.0
      X-Api-Key:
      - "<ADYEN_API_KEY>"
      Idempotency-Key:
      - 1dfe36c9-e335-452e-b9e4-0c8d3205ed46
      Adyen-Library-Name:
      - adyen-ruby-api-library
      Adyen-Library-Version:
      - 10.3.0
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Traceparent:
      - 00-537beff16a7e6d9e19d716237856d2d0-c21672336c11bc7b-01
      X-Frame-Options:
      - SAMEORIGIN
      X-Content-Type-Options:
      - nosniff
      Cache-Control:
      - no-cache, no-store, private, must-revalidate, max-age=0
      Pragma:
      - no-cache
      Expires:
      - '0'
      Set-Cookie:
      - JSESSIONID=9D793A9A36230BA2B8295C42FBFC2259; Path=/checkout; Secure; HttpOnly
      Idempotency-Key:
      - 1dfe36c9-e335-452e-b9e4-0c8d3205ed46
      Pspreference:
      - W6Q6MLN4RMXNPJ65
      Content-Type:
      - application/json;charset=UTF-8
      Content-Length:
      - '2792'
      Date:
      - Tue, 12 Aug 2025 10:49:37 GMT
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
    body:
      encoding: UTF-8
      string: '{"amount":{"currency":"USD","value":11000},"countryCode":"US","expiresAt":"2025-08-13T01:00:00+02:00","id":"CS19A7E49FF1F7A85EAD16271","lineItems":[{"amountExcludingTax":1000,"amountIncludingTax":1000,"description":"Product
        14375","id":"1","quantity":1,"sku":"SKU-1","taxAmount":0,"taxPercentage":0}],"merchantAccount":"SpreeCommerceECOM","merchantOrderReference":"R651007997","metadata":{"spree_payment_method_id":"1","spree_order_id":"R651007997"},"recurringProcessingModel":"UnscheduledCardOnFile","reference":"R651007997_1_1","returnUrl":"http:\/\/www.example.com\/adyen\/payment_sessions\/redirect","shopperInteraction":"Ecommerce","shopperLocale":"en-US","shopperName":{"firstName":"John","lastName":"Doe"},"shopperReference":"guest_R651007997","storePaymentMethodMode":"enabled","mode":"embedded","sessionData":"Ab02b4c0!BQABAgB17cD6XOjrSSrl5XGC7bFKaMPUAoWjxAx5u5emHgJRPVv1LfwrbjqtfNDYlDjz78Te4crnx5E7LN6c\/qYZdBptcVy8tcKK2mJajyDXzGVy5dwqmUVVbM1k\/0EgoVahjDIRyCVe02A0pSiYCB+tAI5jy48TEeaWHcZJxJS7hfDvoD\/\/67kHG9OM7zg2neiz0DBtzwP8z2ACFrQmwn1h15s+eg\/QixTElUdrmZbon7HNbAPuoe+9MKa2eo2q6H181Q\/vdHSPTHQWYuFwReaz9WDzQiP+JR+8le7jEA3rWAtA+slsPZz0XBmtXJdYg4HMt7dxzIJxXcVgtdLLS34M9aKCCCFjxwWhh7eFv5+hmAhEsF70HjsjAm6T2DtOf7h5o7MrBYQBM6RBiKwhaMsmEsq7vNO49wDxdzrm3uqa+0Wdnv0Vk1HDWu2ZMEnYoNltPeemOYSzsco5AiVqRhHbCw12F1XkKgHg0TxOSiTElPYXLWv2xdsko3beWYOSZ5a8kW9LjzCtxZodkOwH81U9vt9zcuvhznvj8Dd0d9L8oWQ5opGoEfhUQ\/h0MXrHUW6TVrmMSznnI2a+belTA1Qi7UPe6at5RxSXc3V9mqyNcLjZI0bwNOpztzbpqDadkuQuTQ7RSyFrN3zUz1eCM7L4xR+KpWoTlH0uqDDI4MH+sGPE5QxUqnYPwoClSdtlPwAASnsia2V5IjoiQUYwQUFBMTAzQ0E1MzdFQUVEODdDMjRERDUzOTA5QjgwQTc4QTkyM0UzODIzRDY4REFDQzk0QjlGRjgzMDVEQyJ9rHIliLmZidX33wED1AY1d7HNRVGHlYtFDkYgniToxg6pC8Zwb2EDy2ji+S+rf6btEozVuDWIZG+REJA3ie2AILSYn7vDpm3+ebjgCS\/EDNbuNq+mvYIU6jUft45c8KquT9oXVaee24\/\/VZA9ORMiV1Q7T55KePmMWXBuFRvE4GzfOt2i8HsjO7PXjbPcCVVsVykLVySN5Hi98faNndR7ndCuJ2zeXN6S4FxjJGJeMyPNZ9PViiIiumkshKwUOW9dVJaZKLHQmJuX62\/\/F3u8JrFqbUeTZlDtiDLy5rQqwEo\/\/thrvyTsNqpH+Ozu9cl3CVUAj9mlfh3kBz4UuB73zcMNbZL5SCZOxdX2\/WjZ\/ymTQvdcpBAK4+j5I0MkRJz+86IvjJdY0vFlioIN001PWyvP8mCoQsclaD7FW+ugBaCX8Gx6bZOXw0hqc2atcinALrt0xboiGo01j8ffiKxP+J7K6F6qM9O2alKO7Y43PiB9mTi1aqEsrZKA5QrBHyURD0fDpq6Yd0GXfdS4ql6UxAOqkAAimYme+VrY7EnZCwOBQcE\/bsKlzWfs3QTBLTib+OCN4POQFzPjOrcawzzF3NnJ5EIPQCGBoOc34LhSYHvR3fhDjJNZ4PTprpiITX7ByptmM3\/\/IcQJ\/Aqh3xVaWp+1DM3UbbZErqfkhz6un9XodgDRmmVbNcLWxdY\/bnBsy+Ovn5kZFvw\/HNIxKPOJMgw4gKC+GSfFmr1hXYJYh6qLANuaVTsX0Mu5Hf7zdM2Uo7vn41rOMCLkiP2Bx36VtmHXO3DGVW3W1KzRVjDWE\/B6zOg90\/yAEbYNWtOFk8Z0gsCPYv5OaW+i5aEA1lJEuKkMv9xmx5KfvOZvF23GRmVGCxuefDwJTG0Fi8IQOQLgsQQmtMkXs2YXgYVNZUrrLJoldjm+CQJRUzshOFXoqE44pRm59xgTc4trJVCLaJat+PSIOanSrjiX4\/4pdX1X\/65VVUqSV8IRgu9qgHABlwy8+rPGt3aNX0BMnoTVDj3as9ccyJMhDCpPfOLOXNTvro4Tg3fGpE5WHvzHLPNBGyYXtq4NhfPs94vfLr03dA0l8zs9wPc2nPDpOGNBva7HIHUM6fLFpxv3olOPICCn"}'
  recorded_at: Tue, 12 Aug 2025 22:00:00 GMT
recorded_with: VCR 6.3.1
